#+title: Dash vs CL vs Seq Emacs Lisp library benchmarks

* Setup
:PROPERTIES:
:CREATED_TIME: [2022-09-02 Fri 15:10]
:END:

#+name: benchmark-setup
#+begin_src elisp
;;; experiments/seq-cl-dash-benchmarks.el -*- lexical-binding: t; -*-
(defmacro k/benchmark-run (n &rest forms)
  "Benchmark each of FORMS with `benchmark-run' with N repetitions."
  (declare (indent 1))
  `(list
    '(form\# total gc-count gc-time)
    'hline
    ,@(cl-loop with index = 1
               for form in forms
               collect
               (prog2
                   (garbage-collect)
                   `(cons ,index (benchmark-run ,n
                                   ,form))
                 (cl-incf index)))))

(defmacro k/benchmark-run-compiled (n &rest forms)
  "Benchmark each of FORMS, byte-compiled, with N repetitions."
  (declare (indent 1))
  `(list
    '(form\# total gc-count gc-time)
    'hline
    ,@(cl-loop with index = 1
               for form in forms
               collect
               (prog2
                   (garbage-collect)
                   `(cons ,index
                          ;; Because `benchmark-run-compiled'
                          ;; quotes the lambda, it is not able to
                          ;; see any let form around it.
                          (benchmark-call (native-compile (lambda () ,form))
                                          ,n))
                 (cl-incf index)))))
#+end_src

#+RESULTS: benchmark-setup
: k/benchmark-run-compiled

* Benchmarks
:PROPERTIES:
:CREATED_TIME: [2022-09-02 Fri 15:18]
:END:

** =cl-remove-duplicates=, =-uniq=, =seq-uniq=
:PROPERTIES:
:CREATED_TIME: [2022-09-02 Fri 15:18]
:END:

#+begin_src elisp :noweb yes
<<benchmark-setup>>
(let ((lst (make-list 1000 8))
      (-compare-fn #'=))
  (k/benchmark-run-compiled 10000
    (cl-remove-duplicates lst :test #'=)
    (-uniq lst)
    (seq-uniq lst #'=)))
#+end_src

#+RESULTS:
| form# |              total | gc-count |     gc-time |
|-------+--------------------+----------+-------------|
|     1 |         0.45370201 |        0 |         0.0 |
|     2 |        0.309107982 |        0 |         0.0 |
|     3 | 11.431086259999999 |       90 | 6.992706859 |

Latest before ~native-comp-compiler-options~
#+RESULTS:
| form# |               total | gc-count |            gc-time |
|-------+---------------------+----------+--------------------|
|     1 | 0.46318598099999997 |        0 |                0.0 |
|     2 |         0.302332498 |        0 |                0.0 |
|     3 |         8.727145788 |       90 | 3.9050022250000005 |

GRAPHITE="-fgraphite-identity -floop-nest-optimize -floop-parallelize-all"
#+RESULTS:
| form# |             total | gc-count |     gc-time |
|-------+-------------------+----------+-------------|
|     1 |       0.493596167 |        0 |         0.0 |
|     2 |       0.332954255 |        0 |         0.0 |
|     3 | 7.589732875999999 |       45 | 3.089871422 |

Results after recompiling with -O3 and -march=skylake with GCC
#+RESULTS:
| form# |               total | gc-count |           gc-time |
|-------+---------------------+----------+-------------------|
|     1 |         0.486850657 |        0 |               0.0 |
|     2 | 0.32140624100000004 |        0 |               0.0 |
|     3 |  12.511666872000001 |       90 | 6.162411392999999 |

With Clang and -O3, -flto=thin
#+RESULTS:
| form# |               total | gc-count |     gc-time |
|-------+---------------------+----------+-------------|
|     1 |         0.608860955 |        0 |         0.0 |
|     2 | 0.41814508300000003 |        0 |         0.0 |
|     3 |  12.608610074000001 |       90 | 6.549872463 |

Old results:
#+RESULTS:
| form# |             total | gc-count |           gc-time |
|-------+-------------------+----------+-------------------|
|     1 |        0.51444219 |        0 |               0.0 |
|     2 |       0.397517779 |        0 |               0.0 |
|     3 | 8.744156561999999 |       62 | 4.460399634000001 |

** =cl-some=, =-some=, =seq-some=
:PROPERTIES:
:CREATED_TIME: [2022-09-02 Fri 15:37]
:END:

#+begin_src elisp :noweb yes
<<benchmark-setup>>
(let ((lst (make-list 1000000 8)))
  (k/benchmark-run-compiled 100
    (cl-some #'cl-oddp lst)
    (-some #'cl-oddp lst)
    (seq-some #'cl-oddp lst)))
#+end_src

#+RESULTS:
| form# |              total | gc-count | gc-time |
|-------+--------------------+----------+---------|
|     1 | 1.3323007649999998 |        0 |     0.0 |
|     2 |        1.329049596 |        0 |     0.0 |
|     3 |        3.103197053 |        0 |     0.0 |

Latest before ~native-comp-compiler-options~
#+RESULTS:
| form# |       total | gc-count | gc-time |
|-------+-------------+----------+---------|
|     1 | 1.340823246 |        0 |     0.0 |
|     2 | 1.344405964 |        0 |     0.0 |
|     3 | 3.090915419 |        0 |     0.0 |

GRAPHITE="-fgraphite-identity -floop-nest-optimize -floop-parallelize-all"
#+RESULTS:
| form# |              total | gc-count | gc-time |
|-------+--------------------+----------+---------|
|     1 | 1.4027854160000002 |        0 |     0.0 |
|     2 |        1.369111772 |        0 |     0.0 |
|     3 |        3.157122877 |        0 |     0.0 |

Results after recompiling with -O3 and -march=skylake with GCC
#+RESULTS:
| form# |       total | gc-count | gc-time |
|-------+-------------+----------+---------|
|     1 | 1.443489587 |        0 |     0.0 |
|     2 | 1.394253424 |        0 |     0.0 |
|     3 | 3.100340842 |        0 |     0.0 |

With Clang and -O3, -flto=thin
#+RESULTS:
| form# |       total | gc-count | gc-time |
|-------+-------------+----------+---------|
|     1 | 1.991942513 |        0 |     0.0 |
|     2 | 2.040352603 |        0 |     0.0 |
|     3 | 4.126440601 |        0 |     0.0 |


Old results:
#+RESULTS:
| form# |       total | gc-count | gc-time |
|-------+-------------+----------+---------|
|     1 | 1.421671898 |        0 |     0.0 |
|     2 | 1.367541899 |        0 |     0.0 |
|     3 | 3.920692069 |        0 |     0.0 |

** =cl-remove-if-not=, =-filter=, =seq-filter=
:PROPERTIES:
:CREATED_TIME: [2022-09-02 Fri 15:40]
:END:

#+begin_src elisp :noweb yes
<<benchmark-setup>>
(let ((lst (make-list 100000 8)))
  (k/benchmark-run 100
    (cl-remove-if-not #'cl-oddp lst)
    (-filter #'cl-oddp lst)
    (--filter (cl-oddp it) lst)
    (seq-filter #'cl-oddp lst)))
#+end_src

#+RESULTS:
| form# |              total | gc-count |            gc-time |
|-------+--------------------+----------+--------------------|
|     1 |        0.286898154 |        0 |                0.0 |
|     2 |        0.133175339 |        0 |                0.0 |
|     3 | 26.131588907999998 |      143 | 10.994450967999999 |
|     4 |        1.033979808 |        9 | 0.6797212940000001 |

Latest before ~native-comp-compiler-options~
#+RESULTS:
| form# |        total | gc-count |            gc-time |
|-------+--------------+----------+--------------------|
|     1 |  0.283229917 |        0 |                0.0 |
|     2 |  0.132785873 |        0 |                0.0 |
|     3 | 26.192283986 |      143 |  6.178632387999999 |
|     4 |  0.738455533 |        9 | 0.3924212340000004 |

GRAPHITE="-fgraphite-identity -floop-nest-optimize -floop-parallelize-all"
#+RESULTS:
| form# |       total | gc-count |             gc-time |
|-------+-------------+----------+---------------------|
|     1 | 0.285270708 |        0 |                 0.0 |
|     2 | 0.140052951 |        0 |                 0.0 |
|     3 | 8.656276082 |       71 |   4.631300494999998 |
|     4 | 0.691772183 |        5 | 0.32903805200000136 |

Results after recompiling with -O3 and -march=skylake with GCC
#+RESULTS:
| form# |        total | gc-count |           gc-time |
|-------+--------------+----------+-------------------|
|     1 |  0.307200754 |        0 |               0.0 |
|     2 |   0.14051568 |        0 |               0.0 |
|     3 | 20.553764926 |      143 | 9.038986776000002 |
|     4 |  0.919142631 |        9 | 0.573326514999998 |

(forgot to take clang results)

Old results:
#+RESULTS:
| form# |              total | gc-count |            gc-time |
|-------+--------------------+----------+--------------------|
|     1 |        0.323767573 |        0 |                0.0 |
|     2 |        0.140685723 |        0 |                0.0 |
|     3 |        32.78007469 |      143 |       10.064512013 |
|     4 | 1.0816445650000002 |        9 | 0.6435447110000005 |

** =cl-reduce=, =-reduce-from=, =seq-reduce=
:PROPERTIES:
:CREATED_TIME: [2022-09-02 Fri 15:42]
:END:

#+begin_src elisp :noweb yes
<<benchmark-setup>>
(let (alist)
  (dotimes (i 10000)
    (push (cons i (random 100000)) alist))
  (k/benchmark-run 1000
    (cl-reduce #'+ alist :key #'cdr)
    (-reduce-from
     (lambda (acc it)
       (+ acc (cdr it)))
     0 alist)
    (--reduce-from
     (+ acc (cdr it))
     0 alist)
    (seq-reduce
     (lambda (acc it)
       (+ acc (cdr it)))
     alist 0)))
#+end_src

#+RESULTS:
| form# |              total | gc-count |            gc-time |
|-------+--------------------+----------+--------------------|
|     1 | 1.0215347110000002 |        9 | 0.7031222110000002 |
|     2 |           0.630337 |        0 |                0.0 |
|     3 |       16.371908706 |       95 |  7.077215377999998 |
|     4 | 0.9643951430000001 |        0 |                0.0 |

Latest before ~native-comp-compiler-options~
#+RESULTS:
| form# |              total | gc-count |             gc-time |
|-------+--------------------+----------+---------------------|
|     1 | 0.6649631779999999 |        9 | 0.38730541500000015 |
|     2 |        0.597570053 |        0 |                 0.0 |
|     3 |       15.248649145 |       95 |         4.078324743 |
|     4 |        0.923310333 |        0 |                 0.0 |

GRAPHITE="-fgraphite-identity -floop-nest-optimize -floop-parallelize-all"
#+RESULTS:
| form# |              total | gc-count |           gc-time |
|-------+--------------------+----------+-------------------|
|     1 |        0.558997343 |        4 |       0.255304014 |
|     2 |        0.660300164 |        0 |               0.0 |
|     3 |        6.368575687 |       48 | 3.072646128999999 |
|     4 | 0.9898279799999999 |        0 |               0.0 |

Results after recompiling with -O3 and -march=skylake with GCC
#+RESULTS:
| form# |              total | gc-count |            gc-time |
|-------+--------------------+----------+--------------------|
|     1 | 0.8475778620000001 |        9 | 0.5681250109999993 |
|     2 | 0.6368698279999999 |        0 |                0.0 |
|     3 |       13.021640997 |       95 |  5.958606903000003 |
|     4 | 0.9302371279999999 |        0 |                0.0 |

With Clang and -O3, -flto=thin
#+RESULTS:
| form# |              total | gc-count |            gc-time |
|-------+--------------------+----------+--------------------|
|     1 |        1.169519602 |        9 | 0.7553499819999985 |
|     2 |        0.752585681 |        0 |                0.0 |
|     3 | 22.494633366000002 |       95 |  7.641952104000001 |
|     4 |        1.002289367 |        0 |                0.0 |

Old results:
#+RESULTS:
| form# |              total | gc-count |            gc-time |
|-------+--------------------+----------+--------------------|
|     1 |        1.009781831 |        9 | 0.6360654739999987 |
|     2 |        0.594975909 |        0 |                0.0 |
|     3 | 22.590929926999998 |       95 |  6.710677827000001 |
|     4 |         0.94718291 |        0 |                0.0 |

